GopalSaraf/Practicals/PSDL/include/proc/pic18f96j94.inc
// Register: ADCBUF1
#define ADCBUF1 ADCBUF1
ADCBUF1                                  equ 0E48h

// Register: ADCBUF1L
#define ADCBUF1L ADCBUF1L
ADCBUF1L                                 equ 0E48h
// bitfield definitions
ADCBUF1L_ADCBUF1L_POSN                   equ 0000h
ADCBUF1L_ADCBUF1L_POSITION               equ 0000h
ADCBUF1L_ADCBUF1L_SIZE                   equ 0008h
ADCBUF1L_ADCBUF1L_LENGTH                 equ 0008h
ADCBUF1L_ADCBUF1L_MASK                   equ 00FFh

// Register: ADCBUF1H
#define ADCBUF1H ADCBUF1H
ADCBUF1H                                 equ 0E49h
// bitfield definitions
ADCBUF1H_ADCBUF1H_POSN                   equ 0000h
ADCBUF1H_ADCBUF1H_POSITION               equ 0000h
ADCBUF1H_ADCBUF1H_SIZE                   equ 0008h
ADCBUF1H_ADCBUF1H_LENGTH                 equ 0008h
ADCBUF1H_ADCBUF1H_MASK                   equ 00FFh

// Register: ADCBUF2
#define ADCBUF2 ADCBUF2
ADCBUF2                                  equ 0E4Ah

// Register: ADCBUF2L
#define ADCBUF2L ADCBUF2L
ADCBUF2L                                 equ 0E4Ah
// bitfield definitions
ADCBUF2L_ADCBUF2L_POSN                   equ 0000h
ADCBUF2L_ADCBUF2L_POSITION               equ 0000h
ADCBUF2L_ADCBUF2L_SIZE                   equ 0008h
ADCBUF2L_ADCBUF2L_LENGTH                 equ 0008h
ADCBUF2L_ADCBUF2L_MASK                   equ 00FFh

// Register: ADCBUF2H
#define ADCBUF2H ADCBUF2H
ADCBUF2H                                 equ 0E4Bh
// bitfield definitions
ADCBUF2H_ADCBUF2H_POSN                   equ 0000h
ADCBUF2H_ADCBUF2H_POSITION               equ 0000h
ADCBUF2H_ADCBUF2H_SIZE                   equ 0008h
ADCBUF2H_ADCBUF2H_LENGTH                 equ 0008h
ADCBUF2H_ADCBUF2H_MASK                   equ 00FFh

// Register: ADCBUF3
#define ADCBUF3 ADCBUF3
ADCBUF3                                  equ 0E4Ch

// Register: ADCBUF3L
#define ADCBUF3L ADCBUF3L
ADCBUF3L                                 equ 0E4Ch
// bitfield definitions
ADCBUF3L_ADCBUF3L_POSN                   equ 0000h
ADCBUF3L_ADCBUF3L_POSITION               equ 0000h
ADCBUF3L_ADCBUF3L_SIZE                   equ 0008h
ADCBUF3L_ADCBUF3L_LENGTH                 equ 0008h
ADCBUF3L_ADCBUF3L_MASK                   equ 00FFh

// Register: ADCBUF3H
#define ADCBUF3H ADCBUF3H
ADCBUF3H                                 equ 0E4Dh
// bitfield definitions
ADCBUF3H_ADCBUF3H_POSN                   equ 0000h
ADCBUF3H_ADCBUF3H_POSITION               equ 0000h
ADCBUF3H_ADCBUF3H_SIZE                   equ 0008h
ADCBUF3H_ADCBUF3H_LENGTH                 equ 0008h
ADCBUF3H_ADCBUF3H_MASK                   equ 00FFh

// Register: ADCBUF4
#define ADCBUF4 ADCBUF4
ADCBUF4                                  equ 0E4Eh

// Register: ADCBUF4L
#define ADCBUF4L ADCBUF4L
ADCBUF4L                                 equ 0E4Eh
// bitfield definitions
ADCBUF4L_ADCBUF4L_POSN                   equ 0000h
ADCBUF4L_ADCBUF4L_POSITION               equ 0000h
ADCBUF4L_ADCBUF4L_SIZE                   equ 0008h
ADCBUF4L_ADCBUF4L_LENGTH                 equ 0008h
ADCBUF4L_ADCBUF4L_MASK                   equ 00FFh

// Register: ADCBUF4H
#define ADCBUF4H ADCBUF4H
ADCBUF4H                                 equ 0E4Fh
// bitfield definitions
ADCBUF4H_ADCBUF4H_POSN                   equ 0000h
ADCBUF4H_ADCBUF4H_POSITION               equ 0000h
ADCBUF4H_ADCBUF4H_SIZE                   equ 0008h
ADCBUF4H_ADCBUF4H_LENGTH                 equ 0008h
ADCBUF4H_ADCBUF4H_MASK                   equ 00FFh

// Register: ADCBUF5
#define ADCBUF5 ADCBUF5
ADCBUF5                                  equ 0E50h

// Register: ADCBUF5L
#define ADCBUF5L ADCBUF5L
ADCBUF5L                                 equ 0E50h
// bitfield definitions
ADCBUF5L_ADCBUF5L_POSN                   equ 0000h
ADCBUF5L_ADCBUF5L_POSITION               equ 0000h
ADCBUF5L_ADCBUF5L_SIZE                   equ 0008h
ADCBUF5L_ADCBUF5L_LENGTH                 equ 0008h
ADCBUF5L_ADCBUF5L_MASK                   equ 00FFh

// Register: ADCBUF5H
#define ADCBUF5H ADCBUF5H
ADCBUF5H                                 equ 0E51h
// bitfield definitions
ADCBUF5H_ADCBUF5H_POSN                   equ 0000h
ADCBUF5H_ADCBUF5H_POSITION               equ 0000h
ADCBUF5H_ADCBUF5H_SIZE                   equ 0008h
ADCBUF5H_ADCBUF5H_LENGTH                 equ 0008h
ADCBUF5H_ADCBUF5H_MASK                   equ 00FFh

// Register: ADCBUF6
#define ADCBUF6 ADCBUF6
ADCBUF6                                  equ 0E52h

// Register: ADCBUF6L
#define ADCBUF6L ADCBUF6L
ADCBUF6L                                 equ 0E52h
// bitfield definitions
ADCBUF6L_ADCBUF6L_POSN                   equ 0000h
ADCBUF6L_ADCBUF6L_POSITION               equ 0000h
ADCBUF6L_ADCBUF6L_SIZE                   equ 0008h
ADCBUF6L_ADCBUF6L_LENGTH                 equ 0008h
ADCBUF6L_ADCBUF6L_MASK                   equ 00FFh

// Register: ADCBUF6H
#define ADCBUF6H ADCBUF6H
ADCBUF6H                                 equ 0E53h
// bitfield definitions
ADCBUF6H_ADCBUF6H_POSN                   equ 0000h
ADCBUF6H_ADCBUF6H_POSITION               equ 0000h
ADCBUF6H_ADCBUF6H_SIZE                   equ 0008h
ADCBUF6H_ADCBUF6H_LENGTH                 equ 0008h
ADCBUF6H_ADCBUF6H_MASK                   equ 00FFh

// Register: ADCBUF7
#define ADCBUF7 ADCBUF7
ADCBUF7                                  equ 0E54h

// Register: ADCBUF7L
#define ADCBUF7L ADCBUF7L
ADCBUF7L                                 equ 0E54h
// bitfield definitions
ADCBUF7L_ADCBUF7L_POSN                   equ 0000h
ADCBUF7L_ADCBUF7L_POSITION               equ 0000h
ADCBUF7L_ADCBUF7L_SIZE                   equ 0008h
ADCBUF7L_ADCBUF7L_LENGTH                 equ 0008h
ADCBUF7L_ADCBUF7L_MASK                   equ 00FFh

// Register: ADCBUF7H
#define ADCBUF7H ADCBUF7H
ADCBUF7H                                 equ 0E55h
// bitfield definitions
ADCBUF7H_ADCBUF7H_POSN                   equ 0000h
ADCBUF7H_ADCBUF7H_POSITION               equ 0000h
ADCBUF7H_ADCBUF7H_SIZE                   equ 0008h
ADCBUF7H_ADCBUF7H_LENGTH                 equ 0008h
ADCBUF7H_ADCBUF7H_MASK                   equ 00FFh

// Register: ADCBUF8
#define ADCBUF8 ADCBUF8
ADCBUF8                                  equ 0E56h

