GopalSaraf/Practicals/PSDL/include/proc/pic18f96j94.inc
// Register: ADCSS1L
#define ADCSS1L ADCSS1L
ADCSS1L                                  equ 0E84h
// bitfield definitions
ADCSS1L_CSS_POSN                         equ 0000h
ADCSS1L_CSS_POSITION                     equ 0000h
ADCSS1L_CSS_SIZE                         equ 0008h
ADCSS1L_CSS_LENGTH                       equ 0008h
ADCSS1L_CSS_MASK                         equ 00FFh
ADCSS1L_CSS16_POSN                       equ 0000h
ADCSS1L_CSS16_POSITION                   equ 0000h
ADCSS1L_CSS16_SIZE                       equ 0001h
ADCSS1L_CSS16_LENGTH                     equ 0001h
ADCSS1L_CSS16_MASK                       equ 0001h
ADCSS1L_CSS17_POSN                       equ 0001h
ADCSS1L_CSS17_POSITION                   equ 0001h
ADCSS1L_CSS17_SIZE                       equ 0001h
ADCSS1L_CSS17_LENGTH                     equ 0001h
ADCSS1L_CSS17_MASK                       equ 0002h
ADCSS1L_CSS18_POSN                       equ 0002h
ADCSS1L_CSS18_POSITION                   equ 0002h
ADCSS1L_CSS18_SIZE                       equ 0001h
ADCSS1L_CSS18_LENGTH                     equ 0001h
ADCSS1L_CSS18_MASK                       equ 0004h
ADCSS1L_CSS19_POSN                       equ 0003h
ADCSS1L_CSS19_POSITION                   equ 0003h
ADCSS1L_CSS19_SIZE                       equ 0001h
ADCSS1L_CSS19_LENGTH                     equ 0001h
ADCSS1L_CSS19_MASK                       equ 0008h
ADCSS1L_CSS20_POSN                       equ 0004h
ADCSS1L_CSS20_POSITION                   equ 0004h
ADCSS1L_CSS20_SIZE                       equ 0001h
ADCSS1L_CSS20_LENGTH                     equ 0001h
ADCSS1L_CSS20_MASK                       equ 0010h
ADCSS1L_CSS21_POSN                       equ 0005h
ADCSS1L_CSS21_POSITION                   equ 0005h
ADCSS1L_CSS21_SIZE                       equ 0001h
ADCSS1L_CSS21_LENGTH                     equ 0001h
ADCSS1L_CSS21_MASK                       equ 0020h
ADCSS1L_CSS22_POSN                       equ 0006h
ADCSS1L_CSS22_POSITION                   equ 0006h
ADCSS1L_CSS22_SIZE                       equ 0001h
ADCSS1L_CSS22_LENGTH                     equ 0001h
ADCSS1L_CSS22_MASK                       equ 0040h
ADCSS1L_CSS23_POSN                       equ 0007h
ADCSS1L_CSS23_POSITION                   equ 0007h
ADCSS1L_CSS23_SIZE                       equ 0001h
ADCSS1L_CSS23_LENGTH                     equ 0001h
ADCSS1L_CSS23_MASK                       equ 0080h

// Register: ADCSS1H
#define ADCSS1H ADCSS1H
ADCSS1H                                  equ 0E85h
// bitfield definitions
ADCSS1H_CSS_POSN                         equ 0000h
ADCSS1H_CSS_POSITION                     equ 0000h
ADCSS1H_CSS_SIZE                         equ 0008h
ADCSS1H_CSS_LENGTH                       equ 0008h
ADCSS1H_CSS_MASK                         equ 00FFh
ADCSS1H_CSS24_POSN                       equ 0000h
ADCSS1H_CSS24_POSITION                   equ 0000h
ADCSS1H_CSS24_SIZE                       equ 0001h
ADCSS1H_CSS24_LENGTH                     equ 0001h
ADCSS1H_CSS24_MASK                       equ 0001h
ADCSS1H_CSS25_POSN                       equ 0001h
ADCSS1H_CSS25_POSITION                   equ 0001h
ADCSS1H_CSS25_SIZE                       equ 0001h
ADCSS1H_CSS25_LENGTH                     equ 0001h
ADCSS1H_CSS25_MASK                       equ 0002h
ADCSS1H_CSS26_POSN                       equ 0002h
ADCSS1H_CSS26_POSITION                   equ 0002h
ADCSS1H_CSS26_SIZE                       equ 0001h
ADCSS1H_CSS26_LENGTH                     equ 0001h
ADCSS1H_CSS26_MASK                       equ 0004h
ADCSS1H_CSS27_POSN                       equ 0003h
ADCSS1H_CSS27_POSITION                   equ 0003h
ADCSS1H_CSS27_SIZE                       equ 0001h
ADCSS1H_CSS27_LENGTH                     equ 0001h
ADCSS1H_CSS27_MASK                       equ 0008h
ADCSS1H_CSS28_POSN                       equ 0004h
ADCSS1H_CSS28_POSITION                   equ 0004h
ADCSS1H_CSS28_SIZE                       equ 0001h
ADCSS1H_CSS28_LENGTH                     equ 0001h
ADCSS1H_CSS28_MASK                       equ 0010h
ADCSS1H_CSS29_POSN                       equ 0005h
ADCSS1H_CSS29_POSITION                   equ 0005h
ADCSS1H_CSS29_SIZE                       equ 0001h
ADCSS1H_CSS29_LENGTH                     equ 0001h
ADCSS1H_CSS29_MASK                       equ 0020h
ADCSS1H_CSS30_POSN                       equ 0006h
ADCSS1H_CSS30_POSITION                   equ 0006h
ADCSS1H_CSS30_SIZE                       equ 0001h
ADCSS1H_CSS30_LENGTH                     equ 0001h
ADCSS1H_CSS30_MASK                       equ 0040h

// Register: ADCHS0L
#define ADCHS0L ADCHS0L
ADCHS0L                                  equ 0E86h
// bitfield definitions
ADCHS0L_CH0SA_POSN                       equ 0000h
ADCHS0L_CH0SA_POSITION                   equ 0000h
ADCHS0L_CH0SA_SIZE                       equ 0005h
ADCHS0L_CH0SA_LENGTH                     equ 0005h
ADCHS0L_CH0SA_MASK                       equ 001Fh
ADCHS0L_CH0NA_POSN                       equ 0005h
ADCHS0L_CH0NA_POSITION                   equ 0005h
ADCHS0L_CH0NA_SIZE                       equ 0003h
ADCHS0L_CH0NA_LENGTH                     equ 0003h
ADCHS0L_CH0NA_MASK                       equ 00E0h
ADCHS0L_CH0SA0_POSN                      equ 0000h
ADCHS0L_CH0SA0_POSITION                  equ 0000h
ADCHS0L_CH0SA0_SIZE                      equ 0001h
ADCHS0L_CH0SA0_LENGTH                    equ 0001h
ADCHS0L_CH0SA0_MASK                      equ 0001h
ADCHS0L_CH0SA1_POSN                      equ 0001h
ADCHS0L_CH0SA1_POSITION                  equ 0001h
ADCHS0L_CH0SA1_SIZE                      equ 0001h
ADCHS0L_CH0SA1_LENGTH                    equ 0001h
ADCHS0L_CH0SA1_MASK                      equ 0002h
ADCHS0L_CH0SA2_POSN                      equ 0002h
ADCHS0L_CH0SA2_POSITION                  equ 0002h
ADCHS0L_CH0SA2_SIZE                      equ 0001h
ADCHS0L_CH0SA2_LENGTH                    equ 0001h
ADCHS0L_CH0SA2_MASK                      equ 0004h
ADCHS0L_CH0SA3_POSN                      equ 0003h
ADCHS0L_CH0SA3_POSITION                  equ 0003h
ADCHS0L_CH0SA3_SIZE                      equ 0001h
ADCHS0L_CH0SA3_LENGTH                    equ 0001h
ADCHS0L_CH0SA3_MASK                      equ 0008h
ADCHS0L_CH0SA4_POSN                      equ 0004h
ADCHS0L_CH0SA4_POSITION                  equ 0004h
ADCHS0L_CH0SA4_SIZE                      equ 0001h
ADCHS0L_CH0SA4_LENGTH                    equ 0001h
ADCHS0L_CH0SA4_MASK                      equ 0010h
ADCHS0L_CH0NA0_POSN                      equ 0005h
ADCHS0L_CH0NA0_POSITION                  equ 0005h
ADCHS0L_CH0NA0_SIZE                      equ 0001h
ADCHS0L_CH0NA0_LENGTH                    equ 0001h
ADCHS0L_CH0NA0_MASK                      equ 0020h
ADCHS0L_CH0NA1_POSN                      equ 0006h
ADCHS0L_CH0NA1_POSITION                  equ 0006h
ADCHS0L_CH0NA1_SIZE                      equ 0001h
ADCHS0L_CH0NA1_LENGTH                    equ 0001h
ADCHS0L_CH0NA1_MASK                      equ 0040h
ADCHS0L_CH0NA2_POSN                      equ 0007h
ADCHS0L_CH0NA2_POSITION                  equ 0007h
ADCHS0L_CH0NA2_SIZE                      equ 0001h
ADCHS0L_CH0NA2_LENGTH                    equ 0001h
ADCHS0L_CH0NA2_MASK                      equ 0080h

// Register: ADCHS0H
#define ADCHS0H ADCHS0H
ADCHS0H                                  equ 0E87h
// bitfield definitions
ADCHS0H_CH0SB_POSN                       equ 0000h
ADCHS0H_CH0SB_POSITION                   equ 0000h
ADCHS0H_CH0SB_SIZE                       equ 0005h
ADCHS0H_CH0SB_LENGTH                     equ 0005h
ADCHS0H_CH0SB_MASK                       equ 001Fh
ADCHS0H_CH0NB_POSN                       equ 0005h
ADCHS0H_CH0NB_POSITION                   equ 0005h
ADCHS0H_CH0NB_SIZE                       equ 0003h
ADCHS0H_CH0NB_LENGTH                     equ 0003h
ADCHS0H_CH0NB_MASK                       equ 00E0h
ADCHS0H_CH0SB0_POSN                      equ 0000h
ADCHS0H_CH0SB0_POSITION                  equ 0000h
ADCHS0H_CH0SB0_SIZE                      equ 0001h
ADCHS0H_CH0SB0_LENGTH                    equ 0001h
ADCHS0H_CH0SB0_MASK                      equ 0001h
ADCHS0H_CH0SB1_POSN                      equ 0001h
ADCHS0H_CH0SB1_POSITION                  equ 0001h
ADCHS0H_CH0SB1_SIZE                      equ 0001h
ADCHS0H_CH0SB1_LENGTH                    equ 0001h
ADCHS0H_CH0SB1_MASK                      equ 0002h
ADCHS0H_CH0SB2_POSN                      equ 0002h
ADCHS0H_CH0SB2_POSITION                  equ 0002h
ADCHS0H_CH0SB2_SIZE                      equ 0001h
ADCHS0H_CH0SB2_LENGTH                    equ 0001h
ADCHS0H_CH0SB2_MASK                      equ 0004h
ADCHS0H_CH0SB3_POSN                      equ 0003h
ADCHS0H_CH0SB3_POSITION                  equ 0003h
ADCHS0H_CH0SB3_SIZE                      equ 0001h
ADCHS0H_CH0SB3_LENGTH                    equ 0001h
ADCHS0H_CH0SB3_MASK                      equ 0008h
ADCHS0H_CH0SB4_POSN                      equ 0004h
ADCHS0H_CH0SB4_POSITION                  equ 0004h
ADCHS0H_CH0SB4_SIZE                      equ 0001h
ADCHS0H_CH0SB4_LENGTH                    equ 0001h
ADCHS0H_CH0SB4_MASK                      equ 0010h
ADCHS0H_CH0NB0_POSN                      equ 0005h
ADCHS0H_CH0NB0_POSITION                  equ 0005h
ADCHS0H_CH0NB0_SIZE                      equ 0001h
ADCHS0H_CH0NB0_LENGTH                    equ 0001h
ADCHS0H_CH0NB0_MASK                      equ 0020h
ADCHS0H_CH0NB1_POSN                      equ 0006h
ADCHS0H_CH0NB1_POSITION                  equ 0006h
ADCHS0H_CH0NB1_SIZE                      equ 0001h
ADCHS0H_CH0NB1_LENGTH                    equ 0001h
ADCHS0H_CH0NB1_MASK                      equ 0040h
ADCHS0H_CH0NB2_POSN                      equ 0007h
ADCHS0H_CH0NB2_POSITION                  equ 0007h
ADCHS0H_CH0NB2_SIZE                      equ 0001h
ADCHS0H_CH0NB2_LENGTH                    equ 0001h
ADCHS0H_CH0NB2_MASK                      equ 0080h

