GopalSaraf/Practicals/PSDL/include/proc/pic18f96j94.inc
// Register: LCDDATA41
#define LCDDATA41 LCDDATA41
LCDDATA41                                equ 0EB7h
// bitfield definitions
LCDDATA41_S08C5_POSN                     equ 0000h
LCDDATA41_S08C5_POSITION                 equ 0000h
LCDDATA41_S08C5_SIZE                     equ 0001h
LCDDATA41_S08C5_LENGTH                   equ 0001h
LCDDATA41_S08C5_MASK                     equ 0001h
LCDDATA41_S09C5_POSN                     equ 0001h
LCDDATA41_S09C5_POSITION                 equ 0001h
LCDDATA41_S09C5_SIZE                     equ 0001h
LCDDATA41_S09C5_LENGTH                   equ 0001h
LCDDATA41_S09C5_MASK                     equ 0002h
LCDDATA41_S10C5_POSN                     equ 0002h
LCDDATA41_S10C5_POSITION                 equ 0002h
LCDDATA41_S10C5_SIZE                     equ 0001h
LCDDATA41_S10C5_LENGTH                   equ 0001h
LCDDATA41_S10C5_MASK                     equ 0004h
LCDDATA41_S11C5_POSN                     equ 0003h
LCDDATA41_S11C5_POSITION                 equ 0003h
LCDDATA41_S11C5_SIZE                     equ 0001h
LCDDATA41_S11C5_LENGTH                   equ 0001h
LCDDATA41_S11C5_MASK                     equ 0008h
LCDDATA41_S12C5_POSN                     equ 0004h
LCDDATA41_S12C5_POSITION                 equ 0004h
LCDDATA41_S12C5_SIZE                     equ 0001h
LCDDATA41_S12C5_LENGTH                   equ 0001h
LCDDATA41_S12C5_MASK                     equ 0010h
LCDDATA41_S13C5_POSN                     equ 0005h
LCDDATA41_S13C5_POSITION                 equ 0005h
LCDDATA41_S13C5_SIZE                     equ 0001h
LCDDATA41_S13C5_LENGTH                   equ 0001h
LCDDATA41_S13C5_MASK                     equ 0020h
LCDDATA41_S14C5_POSN                     equ 0006h
LCDDATA41_S14C5_POSITION                 equ 0006h
LCDDATA41_S14C5_SIZE                     equ 0001h
LCDDATA41_S14C5_LENGTH                   equ 0001h
LCDDATA41_S14C5_MASK                     equ 0040h
LCDDATA41_S15C5_POSN                     equ 0007h
LCDDATA41_S15C5_POSITION                 equ 0007h
LCDDATA41_S15C5_SIZE                     equ 0001h
LCDDATA41_S15C5_LENGTH                   equ 0001h
LCDDATA41_S15C5_MASK                     equ 0080h

// Register: LCDDATA42
#define LCDDATA42 LCDDATA42
LCDDATA42                                equ 0EB8h
// bitfield definitions
LCDDATA42_S16C5_POSN                     equ 0000h
LCDDATA42_S16C5_POSITION                 equ 0000h
LCDDATA42_S16C5_SIZE                     equ 0001h
LCDDATA42_S16C5_LENGTH                   equ 0001h
LCDDATA42_S16C5_MASK                     equ 0001h
LCDDATA42_S17C5_POSN                     equ 0001h
LCDDATA42_S17C5_POSITION                 equ 0001h
LCDDATA42_S17C5_SIZE                     equ 0001h
LCDDATA42_S17C5_LENGTH                   equ 0001h
LCDDATA42_S17C5_MASK                     equ 0002h
LCDDATA42_S18C5_POSN                     equ 0002h
LCDDATA42_S18C5_POSITION                 equ 0002h
LCDDATA42_S18C5_SIZE                     equ 0001h
LCDDATA42_S18C5_LENGTH                   equ 0001h
LCDDATA42_S18C5_MASK                     equ 0004h
LCDDATA42_S19C5_POSN                     equ 0003h
LCDDATA42_S19C5_POSITION                 equ 0003h
LCDDATA42_S19C5_SIZE                     equ 0001h
LCDDATA42_S19C5_LENGTH                   equ 0001h
LCDDATA42_S19C5_MASK                     equ 0008h
LCDDATA42_S20C5_POSN                     equ 0004h
LCDDATA42_S20C5_POSITION                 equ 0004h
LCDDATA42_S20C5_SIZE                     equ 0001h
LCDDATA42_S20C5_LENGTH                   equ 0001h
LCDDATA42_S20C5_MASK                     equ 0010h
LCDDATA42_S21C5_POSN                     equ 0005h
LCDDATA42_S21C5_POSITION                 equ 0005h
LCDDATA42_S21C5_SIZE                     equ 0001h
LCDDATA42_S21C5_LENGTH                   equ 0001h
LCDDATA42_S21C5_MASK                     equ 0020h
LCDDATA42_S22C5_POSN                     equ 0006h
LCDDATA42_S22C5_POSITION                 equ 0006h
LCDDATA42_S22C5_SIZE                     equ 0001h
LCDDATA42_S22C5_LENGTH                   equ 0001h
LCDDATA42_S22C5_MASK                     equ 0040h
LCDDATA42_S23C5_POSN                     equ 0007h
LCDDATA42_S23C5_POSITION                 equ 0007h
LCDDATA42_S23C5_SIZE                     equ 0001h
LCDDATA42_S23C5_LENGTH                   equ 0001h
LCDDATA42_S23C5_MASK                     equ 0080h

// Register: LCDDATA43
#define LCDDATA43 LCDDATA43
LCDDATA43                                equ 0EB9h
// bitfield definitions
LCDDATA43_S24C5_POSN                     equ 0000h
LCDDATA43_S24C5_POSITION                 equ 0000h
LCDDATA43_S24C5_SIZE                     equ 0001h
LCDDATA43_S24C5_LENGTH                   equ 0001h
LCDDATA43_S24C5_MASK                     equ 0001h
LCDDATA43_S25C5_POSN                     equ 0001h
LCDDATA43_S25C5_POSITION                 equ 0001h
LCDDATA43_S25C5_SIZE                     equ 0001h
LCDDATA43_S25C5_LENGTH                   equ 0001h
LCDDATA43_S25C5_MASK                     equ 0002h
LCDDATA43_S26C5_POSN                     equ 0002h
LCDDATA43_S26C5_POSITION                 equ 0002h
LCDDATA43_S26C5_SIZE                     equ 0001h
LCDDATA43_S26C5_LENGTH                   equ 0001h
LCDDATA43_S26C5_MASK                     equ 0004h
LCDDATA43_S27C5_POSN                     equ 0003h
LCDDATA43_S27C5_POSITION                 equ 0003h
LCDDATA43_S27C5_SIZE                     equ 0001h
LCDDATA43_S27C5_LENGTH                   equ 0001h
LCDDATA43_S27C5_MASK                     equ 0008h
LCDDATA43_S28C5_POSN                     equ 0004h
LCDDATA43_S28C5_POSITION                 equ 0004h
LCDDATA43_S28C5_SIZE                     equ 0001h
LCDDATA43_S28C5_LENGTH                   equ 0001h
LCDDATA43_S28C5_MASK                     equ 0010h
LCDDATA43_S29C5_POSN                     equ 0005h
LCDDATA43_S29C5_POSITION                 equ 0005h
LCDDATA43_S29C5_SIZE                     equ 0001h
LCDDATA43_S29C5_LENGTH                   equ 0001h
LCDDATA43_S29C5_MASK                     equ 0020h
LCDDATA43_S30C5_POSN                     equ 0006h
LCDDATA43_S30C5_POSITION                 equ 0006h
LCDDATA43_S30C5_SIZE                     equ 0001h
LCDDATA43_S30C5_LENGTH                   equ 0001h
LCDDATA43_S30C5_MASK                     equ 0040h
LCDDATA43_S31C5_POSN                     equ 0007h
LCDDATA43_S31C5_POSITION                 equ 0007h
LCDDATA43_S31C5_SIZE                     equ 0001h
LCDDATA43_S31C5_LENGTH                   equ 0001h
LCDDATA43_S31C5_MASK                     equ 0080h

// Register: LCDDATA44
#define LCDDATA44 LCDDATA44
LCDDATA44                                equ 0EBAh
// bitfield definitions
LCDDATA44_S32C5_POSN                     equ 0000h
LCDDATA44_S32C5_POSITION                 equ 0000h
LCDDATA44_S32C5_SIZE                     equ 0001h
LCDDATA44_S32C5_LENGTH                   equ 0001h
LCDDATA44_S32C5_MASK                     equ 0001h
LCDDATA44_S33C5_POSN                     equ 0001h
LCDDATA44_S33C5_POSITION                 equ 0001h
LCDDATA44_S33C5_SIZE                     equ 0001h
LCDDATA44_S33C5_LENGTH                   equ 0001h
LCDDATA44_S33C5_MASK                     equ 0002h
LCDDATA44_S34C5_POSN                     equ 0002h
LCDDATA44_S34C5_POSITION                 equ 0002h
LCDDATA44_S34C5_SIZE                     equ 0001h
LCDDATA44_S34C5_LENGTH                   equ 0001h
LCDDATA44_S34C5_MASK                     equ 0004h
LCDDATA44_S35C5_POSN                     equ 0003h
LCDDATA44_S35C5_POSITION                 equ 0003h
LCDDATA44_S35C5_SIZE                     equ 0001h
LCDDATA44_S35C5_LENGTH                   equ 0001h
LCDDATA44_S35C5_MASK                     equ 0008h
LCDDATA44_S36C5_POSN                     equ 0004h
LCDDATA44_S36C5_POSITION                 equ 0004h
LCDDATA44_S36C5_SIZE                     equ 0001h
LCDDATA44_S36C5_LENGTH                   equ 0001h
LCDDATA44_S36C5_MASK                     equ 0010h
LCDDATA44_S37C5_POSN                     equ 0005h
LCDDATA44_S37C5_POSITION                 equ 0005h
LCDDATA44_S37C5_SIZE                     equ 0001h
LCDDATA44_S37C5_LENGTH                   equ 0001h
LCDDATA44_S37C5_MASK                     equ 0020h
LCDDATA44_S38C5_POSN                     equ 0006h
LCDDATA44_S38C5_POSITION                 equ 0006h
LCDDATA44_S38C5_SIZE                     equ 0001h
LCDDATA44_S38C5_LENGTH                   equ 0001h
LCDDATA44_S38C5_MASK                     equ 0040h
LCDDATA44_S39C5_POSN                     equ 0007h
LCDDATA44_S39C5_POSITION                 equ 0007h
LCDDATA44_S39C5_SIZE                     equ 0001h
LCDDATA44_S39C5_LENGTH                   equ 0001h
LCDDATA44_S39C5_MASK                     equ 0080h

// Register: LCDDATA45
#define LCDDATA45 LCDDATA45
LCDDATA45                                equ 0EBBh
// bitfield definitions
LCDDATA45_S40C5_POSN                     equ 0000h
LCDDATA45_S40C5_POSITION                 equ 0000h
LCDDATA45_S40C5_SIZE                     equ 0001h
LCDDATA45_S40C5_LENGTH                   equ 0001h
LCDDATA45_S40C5_MASK                     equ 0001h
LCDDATA45_S41C5_POSN                     equ 0001h
LCDDATA45_S41C5_POSITION                 equ 0001h
LCDDATA45_S41C5_SIZE                     equ 0001h
LCDDATA45_S41C5_LENGTH                   equ 0001h
LCDDATA45_S41C5_MASK                     equ 0002h
LCDDATA45_S42C5_POSN                     equ 0002h
LCDDATA45_S42C5_POSITION                 equ 0002h
LCDDATA45_S42C5_SIZE                     equ 0001h
LCDDATA45_S42C5_LENGTH                   equ 0001h
LCDDATA45_S42C5_MASK                     equ 0004h
LCDDATA45_S43C5_POSN                     equ 0003h
LCDDATA45_S43C5_POSITION                 equ 0003h
LCDDATA45_S43C5_SIZE                     equ 0001h
LCDDATA45_S43C5_LENGTH                   equ 0001h
LCDDATA45_S43C5_MASK                     equ 0008h
LCDDATA45_S44C5_POSN                     equ 0004h
LCDDATA45_S44C5_POSITION                 equ 0004h
LCDDATA45_S44C5_SIZE                     equ 0001h
LCDDATA45_S44C5_LENGTH                   equ 0001h
LCDDATA45_S44C5_MASK                     equ 0010h
LCDDATA45_S45C5_POSN                     equ 0005h
LCDDATA45_S45C5_POSITION                 equ 0005h
LCDDATA45_S45C5_SIZE                     equ 0001h
LCDDATA45_S45C5_LENGTH                   equ 0001h
LCDDATA45_S45C5_MASK                     equ 0020h
LCDDATA45_S46C5_POSN                     equ 0006h
LCDDATA45_S46C5_POSITION                 equ 0006h
LCDDATA45_S46C5_SIZE                     equ 0001h
LCDDATA45_S46C5_LENGTH                   equ 0001h
LCDDATA45_S46C5_MASK                     equ 0040h
LCDDATA45_S47C5_POSN                     equ 0007h
LCDDATA45_S47C5_POSITION                 equ 0007h
LCDDATA45_S47C5_SIZE                     equ 0001h
LCDDATA45_S47C5_LENGTH                   equ 0001h
LCDDATA45_S47C5_MASK                     equ 0080h

// Register: LCDDATA46
#define LCDDATA46 LCDDATA46
LCDDATA46                                equ 0EBCh
// bitfield definitions
LCDDATA46_S48C5_POSN                     equ 0000h
LCDDATA46_S48C5_POSITION                 equ 0000h
LCDDATA46_S48C5_SIZE                     equ 0001h
LCDDATA46_S48C5_LENGTH                   equ 0001h
LCDDATA46_S48C5_MASK                     equ 0001h
LCDDATA46_S49C5_POSN                     equ 0001h
LCDDATA46_S49C5_POSITION                 equ 0001h
LCDDATA46_S49C5_SIZE                     equ 0001h
LCDDATA46_S49C5_LENGTH                   equ 0001h
LCDDATA46_S49C5_MASK                     equ 0002h
LCDDATA46_S50C5_POSN                     equ 0002h
LCDDATA46_S50C5_POSITION                 equ 0002h
LCDDATA46_S50C5_SIZE                     equ 0001h
LCDDATA46_S50C5_LENGTH                   equ 0001h
LCDDATA46_S50C5_MASK                     equ 0004h
LCDDATA46_S51C5_POSN                     equ 0003h
LCDDATA46_S51C5_POSITION                 equ 0003h
LCDDATA46_S51C5_SIZE                     equ 0001h
LCDDATA46_S51C5_LENGTH                   equ 0001h
LCDDATA46_S51C5_MASK                     equ 0008h
LCDDATA46_S52C5_POSN                     equ 0004h
LCDDATA46_S52C5_POSITION                 equ 0004h
LCDDATA46_S52C5_SIZE                     equ 0001h
LCDDATA46_S52C5_LENGTH                   equ 0001h
LCDDATA46_S52C5_MASK                     equ 0010h
LCDDATA46_S53C5_POSN                     equ 0005h
LCDDATA46_S53C5_POSITION                 equ 0005h
LCDDATA46_S53C5_SIZE                     equ 0001h
LCDDATA46_S53C5_LENGTH                   equ 0001h
LCDDATA46_S53C5_MASK                     equ 0020h
LCDDATA46_S54C5_POSN                     equ 0006h
LCDDATA46_S54C5_POSITION                 equ 0006h
LCDDATA46_S54C5_SIZE                     equ 0001h
LCDDATA46_S54C5_LENGTH                   equ 0001h
LCDDATA46_S54C5_MASK                     equ 0040h
LCDDATA46_S55C5_POSN                     equ 0007h
LCDDATA46_S55C5_POSITION                 equ 0007h
LCDDATA46_S55C5_SIZE                     equ 0001h
LCDDATA46_S55C5_LENGTH                   equ 0001h
LCDDATA46_S55C5_MASK                     equ 0080h

// Register: LCDDATA47
#define LCDDATA47 LCDDATA47
LCDDATA47                                equ 0EBDh
// bitfield definitions
LCDDATA47_S56C5_POSN                     equ 0000h
LCDDATA47_S56C5_POSITION                 equ 0000h
LCDDATA47_S56C5_SIZE                     equ 0001h
LCDDATA47_S56C5_LENGTH                   equ 0001h
LCDDATA47_S56C5_MASK                     equ 0001h
LCDDATA47_S57C5_POSN                     equ 0001h
LCDDATA47_S57C5_POSITION                 equ 0001h
LCDDATA47_S57C5_SIZE                     equ 0001h
LCDDATA47_S57C5_LENGTH                   equ 0001h
LCDDATA47_S57C5_MASK                     equ 0002h
LCDDATA47_S58C5_POSN                     equ 0002h
LCDDATA47_S58C5_POSITION                 equ 0002h
LCDDATA47_S58C5_SIZE                     equ 0001h
LCDDATA47_S58C5_LENGTH                   equ 0001h
LCDDATA47_S58C5_MASK                     equ 0004h
LCDDATA47_S59C5_POSN                     equ 0003h
LCDDATA47_S59C5_POSITION                 equ 0003h
LCDDATA47_S59C5_SIZE                     equ 0001h
LCDDATA47_S59C5_LENGTH                   equ 0001h
LCDDATA47_S59C5_MASK                     equ 0008h
LCDDATA47_S60C5_POSN                     equ 0004h
LCDDATA47_S60C5_POSITION                 equ 0004h
LCDDATA47_S60C5_SIZE                     equ 0001h
LCDDATA47_S60C5_LENGTH                   equ 0001h
LCDDATA47_S60C5_MASK                     equ 0010h
LCDDATA47_S61C5_POSN                     equ 0005h
LCDDATA47_S61C5_POSITION                 equ 0005h
LCDDATA47_S61C5_SIZE                     equ 0001h
LCDDATA47_S61C5_LENGTH                   equ 0001h
LCDDATA47_S61C5_MASK                     equ 0020h
LCDDATA47_S62C5_POSN                     equ 0006h
LCDDATA47_S62C5_POSITION                 equ 0006h
LCDDATA47_S62C5_SIZE                     equ 0001h
LCDDATA47_S62C5_LENGTH                   equ 0001h
LCDDATA47_S62C5_MASK                     equ 0040h
LCDDATA47_S63C5_POSN                     equ 0007h
LCDDATA47_S63C5_POSITION                 equ 0007h
LCDDATA47_S63C5_SIZE                     equ 0001h
LCDDATA47_S63C5_LENGTH                   equ 0001h
LCDDATA47_S63C5_MASK                     equ 0080h

