GopalSaraf/Practicals/PSDL/include/proc/pic18f96j94.inc
// Register: SSP2STAT
#define SSP2STAT SSP2STAT
SSP2STAT                                 equ 0F1Ah
// bitfield definitions
SSP2STAT_R_NOT_W_POSN                    equ 0002h
SSP2STAT_R_NOT_W_POSITION                equ 0002h
SSP2STAT_R_NOT_W_SIZE                    equ 0001h
SSP2STAT_R_NOT_W_LENGTH                  equ 0001h
SSP2STAT_R_NOT_W_MASK                    equ 0004h
SSP2STAT_D_NOT_A_POSN                    equ 0005h
SSP2STAT_D_NOT_A_POSITION                equ 0005h
SSP2STAT_D_NOT_A_SIZE                    equ 0001h
SSP2STAT_D_NOT_A_LENGTH                  equ 0001h
SSP2STAT_D_NOT_A_MASK                    equ 0020h
SSP2STAT_BF_POSN                         equ 0000h
SSP2STAT_BF_POSITION                     equ 0000h
SSP2STAT_BF_SIZE                         equ 0001h
SSP2STAT_BF_LENGTH                       equ 0001h
SSP2STAT_BF_MASK                         equ 0001h
SSP2STAT_UA_POSN                         equ 0001h
SSP2STAT_UA_POSITION                     equ 0001h
SSP2STAT_UA_SIZE                         equ 0001h
SSP2STAT_UA_LENGTH                       equ 0001h
SSP2STAT_UA_MASK                         equ 0002h
SSP2STAT_R_nW_POSN                       equ 0002h
SSP2STAT_R_nW_POSITION                   equ 0002h
SSP2STAT_R_nW_SIZE                       equ 0001h
SSP2STAT_R_nW_LENGTH                     equ 0001h
SSP2STAT_R_nW_MASK                       equ 0004h
SSP2STAT_S_POSN                          equ 0003h
SSP2STAT_S_POSITION                      equ 0003h
SSP2STAT_S_SIZE                          equ 0001h
SSP2STAT_S_LENGTH                        equ 0001h
SSP2STAT_S_MASK                          equ 0008h
SSP2STAT_P_POSN                          equ 0004h
SSP2STAT_P_POSITION                      equ 0004h
SSP2STAT_P_SIZE                          equ 0001h
SSP2STAT_P_LENGTH                        equ 0001h
SSP2STAT_P_MASK                          equ 0010h
SSP2STAT_D_nA_POSN                       equ 0005h
SSP2STAT_D_nA_POSITION                   equ 0005h
SSP2STAT_D_nA_SIZE                       equ 0001h
SSP2STAT_D_nA_LENGTH                     equ 0001h
SSP2STAT_D_nA_MASK                       equ 0020h
SSP2STAT_CKE_POSN                        equ 0006h
SSP2STAT_CKE_POSITION                    equ 0006h
SSP2STAT_CKE_SIZE                        equ 0001h
SSP2STAT_CKE_LENGTH                      equ 0001h
SSP2STAT_CKE_MASK                        equ 0040h
SSP2STAT_SMP_POSN                        equ 0007h
SSP2STAT_SMP_POSITION                    equ 0007h
SSP2STAT_SMP_SIZE                        equ 0001h
SSP2STAT_SMP_LENGTH                      equ 0001h
SSP2STAT_SMP_MASK                        equ 0080h
SSP2STAT_R_W_POSN                        equ 0002h
SSP2STAT_R_W_POSITION                    equ 0002h
SSP2STAT_R_W_SIZE                        equ 0001h
SSP2STAT_R_W_LENGTH                      equ 0001h
SSP2STAT_R_W_MASK                        equ 0004h
SSP2STAT_D_A_POSN                        equ 0005h
SSP2STAT_D_A_POSITION                    equ 0005h
SSP2STAT_D_A_SIZE                        equ 0001h
SSP2STAT_D_A_LENGTH                      equ 0001h
SSP2STAT_D_A_MASK                        equ 0020h
SSP2STAT_nW_POSN                         equ 0002h
SSP2STAT_nW_POSITION                     equ 0002h
SSP2STAT_nW_SIZE                         equ 0001h
SSP2STAT_nW_LENGTH                       equ 0001h
SSP2STAT_nW_MASK                         equ 0004h
SSP2STAT_nA_POSN                         equ 0005h
SSP2STAT_nA_POSITION                     equ 0005h
SSP2STAT_nA_SIZE                         equ 0001h
SSP2STAT_nA_LENGTH                       equ 0001h
SSP2STAT_nA_MASK                         equ 0020h
SSP2STAT_NOT_WRITE_POSN                  equ 0002h
SSP2STAT_NOT_WRITE_POSITION              equ 0002h
SSP2STAT_NOT_WRITE_SIZE                  equ 0001h
SSP2STAT_NOT_WRITE_LENGTH                equ 0001h
SSP2STAT_NOT_WRITE_MASK                  equ 0004h
SSP2STAT_NOT_ADDRESS_POSN                equ 0005h
SSP2STAT_NOT_ADDRESS_POSITION            equ 0005h
SSP2STAT_NOT_ADDRESS_SIZE                equ 0001h
SSP2STAT_NOT_ADDRESS_LENGTH              equ 0001h
SSP2STAT_NOT_ADDRESS_MASK                equ 0020h
SSP2STAT_nWRITE_POSN                     equ 0002h
SSP2STAT_nWRITE_POSITION                 equ 0002h
SSP2STAT_nWRITE_SIZE                     equ 0001h
SSP2STAT_nWRITE_LENGTH                   equ 0001h
SSP2STAT_nWRITE_MASK                     equ 0004h
SSP2STAT_nADDRESS_POSN                   equ 0005h
SSP2STAT_nADDRESS_POSITION               equ 0005h
SSP2STAT_nADDRESS_SIZE                   equ 0001h
SSP2STAT_nADDRESS_LENGTH                 equ 0001h
SSP2STAT_nADDRESS_MASK                   equ 0020h
SSP2STAT_READ_WRITE_POSN                 equ 0002h
SSP2STAT_READ_WRITE_POSITION             equ 0002h
SSP2STAT_READ_WRITE_SIZE                 equ 0001h
SSP2STAT_READ_WRITE_LENGTH               equ 0001h
SSP2STAT_READ_WRITE_MASK                 equ 0004h
SSP2STAT_DATA_ADDRESS_POSN               equ 0005h
SSP2STAT_DATA_ADDRESS_POSITION           equ 0005h
SSP2STAT_DATA_ADDRESS_SIZE               equ 0001h
SSP2STAT_DATA_ADDRESS_LENGTH             equ 0001h
SSP2STAT_DATA_ADDRESS_MASK               equ 0020h
SSP2STAT_I2C_READ_POSN                   equ 0002h
SSP2STAT_I2C_READ_POSITION               equ 0002h
SSP2STAT_I2C_READ_SIZE                   equ 0001h
SSP2STAT_I2C_READ_LENGTH                 equ 0001h
SSP2STAT_I2C_READ_MASK                   equ 0004h
SSP2STAT_I2C_START_POSN                  equ 0003h
SSP2STAT_I2C_START_POSITION              equ 0003h
SSP2STAT_I2C_START_SIZE                  equ 0001h
SSP2STAT_I2C_START_LENGTH                equ 0001h
SSP2STAT_I2C_START_MASK                  equ 0008h
SSP2STAT_I2C_STOP_POSN                   equ 0004h
SSP2STAT_I2C_STOP_POSITION               equ 0004h
SSP2STAT_I2C_STOP_SIZE                   equ 0001h
SSP2STAT_I2C_STOP_LENGTH                 equ 0001h
SSP2STAT_I2C_STOP_MASK                   equ 0010h
SSP2STAT_I2C_DAT_POSN                    equ 0005h
SSP2STAT_I2C_DAT_POSITION                equ 0005h
SSP2STAT_I2C_DAT_SIZE                    equ 0001h
SSP2STAT_I2C_DAT_LENGTH                  equ 0001h
SSP2STAT_I2C_DAT_MASK                    equ 0020h
SSP2STAT_BF2_POSN                        equ 0000h
SSP2STAT_BF2_POSITION                    equ 0000h
SSP2STAT_BF2_SIZE                        equ 0001h
SSP2STAT_BF2_LENGTH                      equ 0001h
SSP2STAT_BF2_MASK                        equ 0001h
SSP2STAT_UA2_POSN                        equ 0001h
SSP2STAT_UA2_POSITION                    equ 0001h
SSP2STAT_UA2_SIZE                        equ 0001h
SSP2STAT_UA2_LENGTH                      equ 0001h
SSP2STAT_UA2_MASK                        equ 0002h
SSP2STAT_I2C_READ2_POSN                  equ 0002h
SSP2STAT_I2C_READ2_POSITION              equ 0002h
SSP2STAT_I2C_READ2_SIZE                  equ 0001h
SSP2STAT_I2C_READ2_LENGTH                equ 0001h
SSP2STAT_I2C_READ2_MASK                  equ 0004h
SSP2STAT_I2C_START2_POSN                 equ 0003h
SSP2STAT_I2C_START2_POSITION             equ 0003h
SSP2STAT_I2C_START2_SIZE                 equ 0001h
SSP2STAT_I2C_START2_LENGTH               equ 0001h
SSP2STAT_I2C_START2_MASK                 equ 0008h
SSP2STAT_I2C_STOP2_POSN                  equ 0004h
SSP2STAT_I2C_STOP2_POSITION              equ 0004h
SSP2STAT_I2C_STOP2_SIZE                  equ 0001h
SSP2STAT_I2C_STOP2_LENGTH                equ 0001h
SSP2STAT_I2C_STOP2_MASK                  equ 0010h
SSP2STAT_DA2_POSN                        equ 0005h
SSP2STAT_DA2_POSITION                    equ 0005h
SSP2STAT_DA2_SIZE                        equ 0001h
SSP2STAT_DA2_LENGTH                      equ 0001h
SSP2STAT_DA2_MASK                        equ 0020h
SSP2STAT_CKE2_POSN                       equ 0006h
SSP2STAT_CKE2_POSITION                   equ 0006h
SSP2STAT_CKE2_SIZE                       equ 0001h
SSP2STAT_CKE2_LENGTH                     equ 0001h
SSP2STAT_CKE2_MASK                       equ 0040h
SSP2STAT_SMP2_POSN                       equ 0007h
SSP2STAT_SMP2_POSITION                   equ 0007h
SSP2STAT_SMP2_SIZE                       equ 0001h
SSP2STAT_SMP2_LENGTH                     equ 0001h
SSP2STAT_SMP2_MASK                       equ 0080h
SSP2STAT_READ_WRITE2_POSN                equ 0002h
SSP2STAT_READ_WRITE2_POSITION            equ 0002h
SSP2STAT_READ_WRITE2_SIZE                equ 0001h
SSP2STAT_READ_WRITE2_LENGTH              equ 0001h
SSP2STAT_READ_WRITE2_MASK                equ 0004h
SSP2STAT_S2_POSN                         equ 0003h
SSP2STAT_S2_POSITION                     equ 0003h
SSP2STAT_S2_SIZE                         equ 0001h
SSP2STAT_S2_LENGTH                       equ 0001h
SSP2STAT_S2_MASK                         equ 0008h
SSP2STAT_P2_POSN                         equ 0004h
SSP2STAT_P2_POSITION                     equ 0004h
SSP2STAT_P2_SIZE                         equ 0001h
SSP2STAT_P2_LENGTH                       equ 0001h
SSP2STAT_P2_MASK                         equ 0010h
SSP2STAT_DATA_ADDRESS2_POSN              equ 0005h
SSP2STAT_DATA_ADDRESS2_POSITION          equ 0005h
SSP2STAT_DATA_ADDRESS2_SIZE              equ 0001h
SSP2STAT_DATA_ADDRESS2_LENGTH            equ 0001h
SSP2STAT_DATA_ADDRESS2_MASK              equ 0020h
SSP2STAT_RW2_POSN                        equ 0002h
SSP2STAT_RW2_POSITION                    equ 0002h
SSP2STAT_RW2_SIZE                        equ 0001h
SSP2STAT_RW2_LENGTH                      equ 0001h
SSP2STAT_RW2_MASK                        equ 0004h
SSP2STAT_START2_POSN                     equ 0003h
SSP2STAT_START2_POSITION                 equ 0003h
SSP2STAT_START2_SIZE                     equ 0001h
SSP2STAT_START2_LENGTH                   equ 0001h
SSP2STAT_START2_MASK                     equ 0008h
SSP2STAT_STOP2_POSN                      equ 0004h
SSP2STAT_STOP2_POSITION                  equ 0004h
SSP2STAT_STOP2_SIZE                      equ 0001h
SSP2STAT_STOP2_LENGTH                    equ 0001h
SSP2STAT_STOP2_MASK                      equ 0010h
SSP2STAT_D_A2_POSN                       equ 0005h
SSP2STAT_D_A2_POSITION                   equ 0005h
SSP2STAT_D_A2_SIZE                       equ 0001h
SSP2STAT_D_A2_LENGTH                     equ 0001h
SSP2STAT_D_A2_MASK                       equ 0020h
SSP2STAT_D_NOT_A2_POSN                   equ 0005h
SSP2STAT_D_NOT_A2_POSITION               equ 0005h
SSP2STAT_D_NOT_A2_SIZE                   equ 0001h
SSP2STAT_D_NOT_A2_LENGTH                 equ 0001h
SSP2STAT_D_NOT_A2_MASK                   equ 0020h
SSP2STAT_R_W2_POSN                       equ 0002h
SSP2STAT_R_W2_POSITION                   equ 0002h
SSP2STAT_R_W2_SIZE                       equ 0001h
SSP2STAT_R_W2_LENGTH                     equ 0001h
SSP2STAT_R_W2_MASK                       equ 0004h
SSP2STAT_START_POSN                      equ 0003h
SSP2STAT_START_POSITION                  equ 0003h
SSP2STAT_START_SIZE                      equ 0001h
SSP2STAT_START_LENGTH                    equ 0001h
SSP2STAT_START_MASK                      equ 0008h
SSP2STAT_STOP_POSN                       equ 0004h
SSP2STAT_STOP_POSITION                   equ 0004h
SSP2STAT_STOP_SIZE                       equ 0001h
SSP2STAT_STOP_LENGTH                     equ 0001h
SSP2STAT_STOP_MASK                       equ 0010h
SSP2STAT_D_nA2_POSN                      equ 0005h
SSP2STAT_D_nA2_POSITION                  equ 0005h
SSP2STAT_D_nA2_SIZE                      equ 0001h
SSP2STAT_D_nA2_LENGTH                    equ 0001h
SSP2STAT_D_nA2_MASK                      equ 0020h
SSP2STAT_R_NOT_W2_POSN                   equ 0002h
SSP2STAT_R_NOT_W2_POSITION               equ 0002h
SSP2STAT_R_NOT_W2_SIZE                   equ 0001h
SSP2STAT_R_NOT_W2_LENGTH                 equ 0001h
SSP2STAT_R_NOT_W2_MASK                   equ 0004h
SSP2STAT_R_nW2_POSN                      equ 0002h
SSP2STAT_R_nW2_POSITION                  equ 0002h
SSP2STAT_R_nW2_SIZE                      equ 0001h
SSP2STAT_R_nW2_LENGTH                    equ 0001h
SSP2STAT_R_nW2_MASK                      equ 0004h
SSP2STAT_I2C_DAT2_POSN                   equ 0005h
SSP2STAT_I2C_DAT2_POSITION               equ 0005h
SSP2STAT_I2C_DAT2_SIZE                   equ 0001h
SSP2STAT_I2C_DAT2_LENGTH                 equ 0001h
SSP2STAT_I2C_DAT2_MASK                   equ 0020h
SSP2STAT_NOT_W2_POSN                     equ 0002h
SSP2STAT_NOT_W2_POSITION                 equ 0002h
SSP2STAT_NOT_W2_SIZE                     equ 0001h
SSP2STAT_NOT_W2_LENGTH                   equ 0001h
SSP2STAT_NOT_W2_MASK                     equ 0004h
SSP2STAT_NOT_A2_POSN                     equ 0005h
SSP2STAT_NOT_A2_POSITION                 equ 0005h
SSP2STAT_NOT_A2_SIZE                     equ 0001h
SSP2STAT_NOT_A2_LENGTH                   equ 0001h
SSP2STAT_NOT_A2_MASK                     equ 0020h
SSP2STAT_nW2_POSN                        equ 0002h
SSP2STAT_nW2_POSITION                    equ 0002h
SSP2STAT_nW2_SIZE                        equ 0001h
SSP2STAT_nW2_LENGTH                      equ 0001h
SSP2STAT_nW2_MASK                        equ 0004h
SSP2STAT_nA2_POSN                        equ 0005h
SSP2STAT_nA2_POSITION                    equ 0005h
SSP2STAT_nA2_SIZE                        equ 0001h
SSP2STAT_nA2_LENGTH                      equ 0001h
SSP2STAT_nA2_MASK                        equ 0020h
SSP2STAT_NOT_WRITE2_POSN                 equ 0002h
SSP2STAT_NOT_WRITE2_POSITION             equ 0002h
SSP2STAT_NOT_WRITE2_SIZE                 equ 0001h
SSP2STAT_NOT_WRITE2_LENGTH               equ 0001h
SSP2STAT_NOT_WRITE2_MASK                 equ 0004h
SSP2STAT_NOT_ADDRESS2_POSN               equ 0005h
SSP2STAT_NOT_ADDRESS2_POSITION           equ 0005h
SSP2STAT_NOT_ADDRESS2_SIZE               equ 0001h
SSP2STAT_NOT_ADDRESS2_LENGTH             equ 0001h
SSP2STAT_NOT_ADDRESS2_MASK               equ 0020h
SSP2STAT_nWRITE2_POSN                    equ 0002h
SSP2STAT_nWRITE2_POSITION                equ 0002h
SSP2STAT_nWRITE2_SIZE                    equ 0001h
SSP2STAT_nWRITE2_LENGTH                  equ 0001h
SSP2STAT_nWRITE2_MASK                    equ 0004h
SSP2STAT_nADDRESS2_POSN                  equ 0005h
SSP2STAT_nADDRESS2_POSITION              equ 0005h
SSP2STAT_nADDRESS2_SIZE                  equ 0001h
SSP2STAT_nADDRESS2_LENGTH                equ 0001h
SSP2STAT_nADDRESS2_MASK                  equ 0020h
SSP2STAT_R_POSN                          equ 0002h
SSP2STAT_R_POSITION                      equ 0002h
SSP2STAT_R_SIZE                          equ 0001h
SSP2STAT_R_LENGTH                        equ 0001h
SSP2STAT_R_MASK                          equ 0004h
SSP2STAT_D_POSN                          equ 0005h
SSP2STAT_D_POSITION                      equ 0005h
SSP2STAT_D_SIZE                          equ 0001h
SSP2STAT_D_LENGTH                        equ 0001h
SSP2STAT_D_MASK                          equ 0020h
SSP2STAT_RW_POSN                         equ 0002h
SSP2STAT_RW_POSITION                     equ 0002h
SSP2STAT_RW_SIZE                         equ 0001h
SSP2STAT_RW_LENGTH                       equ 0001h
SSP2STAT_RW_MASK                         equ 0004h
SSP2STAT_DA_POSN                         equ 0005h
SSP2STAT_DA_POSITION                     equ 0005h
SSP2STAT_DA_SIZE                         equ 0001h
SSP2STAT_DA_LENGTH                       equ 0001h
SSP2STAT_DA_MASK                         equ 0020h

// Register: PSTR3CON
#define PSTR3CON PSTR3CON
PSTR3CON                                 equ 0F1Bh
// bitfield definitions
PSTR3CON_STRA_POSN                       equ 0000h
PSTR3CON_STRA_POSITION                   equ 0000h
PSTR3CON_STRA_SIZE                       equ 0001h
PSTR3CON_STRA_LENGTH                     equ 0001h
PSTR3CON_STRA_MASK                       equ 0001h
PSTR3CON_STRB_POSN                       equ 0001h
PSTR3CON_STRB_POSITION                   equ 0001h
PSTR3CON_STRB_SIZE                       equ 0001h
PSTR3CON_STRB_LENGTH                     equ 0001h
PSTR3CON_STRB_MASK                       equ 0002h
PSTR3CON_STRC_POSN                       equ 0002h
PSTR3CON_STRC_POSITION                   equ 0002h
PSTR3CON_STRC_SIZE                       equ 0001h
PSTR3CON_STRC_LENGTH                     equ 0001h
PSTR3CON_STRC_MASK                       equ 0004h
PSTR3CON_STRD_POSN                       equ 0003h
PSTR3CON_STRD_POSITION                   equ 0003h
PSTR3CON_STRD_SIZE                       equ 0001h
PSTR3CON_STRD_LENGTH                     equ 0001h
PSTR3CON_STRD_MASK                       equ 0008h
PSTR3CON_STRSYNC_POSN                    equ 0004h
PSTR3CON_STRSYNC_POSITION                equ 0004h
PSTR3CON_STRSYNC_SIZE                    equ 0001h
PSTR3CON_STRSYNC_LENGTH                  equ 0001h
PSTR3CON_STRSYNC_MASK                    equ 0010h
PSTR3CON_CMPL_POSN                       equ 0006h
PSTR3CON_CMPL_POSITION                   equ 0006h
PSTR3CON_CMPL_SIZE                       equ 0002h
PSTR3CON_CMPL_LENGTH                     equ 0002h
PSTR3CON_CMPL_MASK                       equ 00C0h
PSTR3CON_CMPL0_POSN                      equ 0006h
PSTR3CON_CMPL0_POSITION                  equ 0006h
PSTR3CON_CMPL0_SIZE                      equ 0001h
PSTR3CON_CMPL0_LENGTH                    equ 0001h
PSTR3CON_CMPL0_MASK                      equ 0040h
PSTR3CON_CMPL1_POSN                      equ 0007h
PSTR3CON_CMPL1_POSITION                  equ 0007h
PSTR3CON_CMPL1_SIZE                      equ 0001h
PSTR3CON_CMPL1_LENGTH                    equ 0001h
PSTR3CON_CMPL1_MASK                      equ 0080h
PSTR3CON_STRA3_POSN                      equ 0000h
PSTR3CON_STRA3_POSITION                  equ 0000h
PSTR3CON_STRA3_SIZE                      equ 0001h
PSTR3CON_STRA3_LENGTH                    equ 0001h
PSTR3CON_STRA3_MASK                      equ 0001h
PSTR3CON_STRB3_POSN                      equ 0001h
PSTR3CON_STRB3_POSITION                  equ 0001h
PSTR3CON_STRB3_SIZE                      equ 0001h
PSTR3CON_STRB3_LENGTH                    equ 0001h
PSTR3CON_STRB3_MASK                      equ 0002h
PSTR3CON_STRC3_POSN                      equ 0002h
PSTR3CON_STRC3_POSITION                  equ 0002h
PSTR3CON_STRC3_SIZE                      equ 0001h
PSTR3CON_STRC3_LENGTH                    equ 0001h
PSTR3CON_STRC3_MASK                      equ 0004h
PSTR3CON_STRD3_POSN                      equ 0003h
PSTR3CON_STRD3_POSITION                  equ 0003h
PSTR3CON_STRD3_SIZE                      equ 0001h
PSTR3CON_STRD3_LENGTH                    equ 0001h
PSTR3CON_STRD3_MASK                      equ 0008h
PSTR3CON_STRSYNC3_POSN                   equ 0004h
PSTR3CON_STRSYNC3_POSITION               equ 0004h
PSTR3CON_STRSYNC3_SIZE                   equ 0001h
PSTR3CON_STRSYNC3_LENGTH                 equ 0001h
PSTR3CON_STRSYNC3_MASK                   equ 0010h
PSTR3CON_CMPL03_POSN                     equ 0006h
PSTR3CON_CMPL03_POSITION                 equ 0006h
PSTR3CON_CMPL03_SIZE                     equ 0001h
PSTR3CON_CMPL03_LENGTH                   equ 0001h
PSTR3CON_CMPL03_MASK                     equ 0040h
PSTR3CON_CMPL13_POSN                     equ 0007h
PSTR3CON_CMPL13_POSITION                 equ 0007h
PSTR3CON_CMPL13_SIZE                     equ 0001h
PSTR3CON_CMPL13_LENGTH                   equ 0001h
PSTR3CON_CMPL13_MASK                     equ 0080h
PSTR3CON_P3DC02_POSN                     equ 0000h
PSTR3CON_P3DC02_POSITION                 equ 0000h
PSTR3CON_P3DC02_SIZE                     equ 0001h
PSTR3CON_P3DC02_LENGTH                   equ 0001h
PSTR3CON_P3DC02_MASK                     equ 0001h
PSTR3CON_P3DC12_POSN                     equ 0001h
PSTR3CON_P3DC12_POSITION                 equ 0001h
PSTR3CON_P3DC12_SIZE                     equ 0001h
PSTR3CON_P3DC12_LENGTH                   equ 0001h
PSTR3CON_P3DC12_MASK                     equ 0002h
PSTR3CON_P3DC22_POSN                     equ 0002h
PSTR3CON_P3DC22_POSITION                 equ 0002h
PSTR3CON_P3DC22_SIZE                     equ 0001h
PSTR3CON_P3DC22_LENGTH                   equ 0001h
PSTR3CON_P3DC22_MASK                     equ 0004h
PSTR3CON_P3DC32_POSN                     equ 0003h
PSTR3CON_P3DC32_POSITION                 equ 0003h
PSTR3CON_P3DC32_SIZE                     equ 0001h
PSTR3CON_P3DC32_LENGTH                   equ 0001h
PSTR3CON_P3DC32_MASK                     equ 0008h
PSTR3CON_P3DC42_POSN                     equ 0004h
PSTR3CON_P3DC42_POSITION                 equ 0004h
PSTR3CON_P3DC42_SIZE                     equ 0001h
PSTR3CON_P3DC42_LENGTH                   equ 0001h
PSTR3CON_P3DC42_MASK                     equ 0010h
PSTR3CON_P3DC62_POSN                     equ 0006h
PSTR3CON_P3DC62_POSITION                 equ 0006h
PSTR3CON_P3DC62_SIZE                     equ 0001h
PSTR3CON_P3DC62_LENGTH                   equ 0001h
PSTR3CON_P3DC62_MASK                     equ 0040h
PSTR3CON_P3DC0CON_POSN                   equ 0000h
PSTR3CON_P3DC0CON_POSITION               equ 0000h
PSTR3CON_P3DC0CON_SIZE                   equ 0001h
PSTR3CON_P3DC0CON_LENGTH                 equ 0001h
PSTR3CON_P3DC0CON_MASK                   equ 0001h
PSTR3CON_P3DC1CON_POSN                   equ 0001h
PSTR3CON_P3DC1CON_POSITION               equ 0001h
PSTR3CON_P3DC1CON_SIZE                   equ 0001h
PSTR3CON_P3DC1CON_LENGTH                 equ 0001h
PSTR3CON_P3DC1CON_MASK                   equ 0002h
PSTR3CON_P3DC2CON_POSN                   equ 0002h
PSTR3CON_P3DC2CON_POSITION               equ 0002h
PSTR3CON_P3DC2CON_SIZE                   equ 0001h
PSTR3CON_P3DC2CON_LENGTH                 equ 0001h
PSTR3CON_P3DC2CON_MASK                   equ 0004h
PSTR3CON_P3DC3CON_POSN                   equ 0003h
PSTR3CON_P3DC3CON_POSITION               equ 0003h
PSTR3CON_P3DC3CON_SIZE                   equ 0001h
PSTR3CON_P3DC3CON_LENGTH                 equ 0001h
PSTR3CON_P3DC3CON_MASK                   equ 0008h
PSTR3CON_P3DC4CON_POSN                   equ 0004h
PSTR3CON_P3DC4CON_POSITION               equ 0004h
PSTR3CON_P3DC4CON_SIZE                   equ 0001h
PSTR3CON_P3DC4CON_LENGTH                 equ 0001h
PSTR3CON_P3DC4CON_MASK                   equ 0010h
PSTR3CON_P3DC6CON_POSN                   equ 0006h
PSTR3CON_P3DC6CON_POSITION               equ 0006h
PSTR3CON_P3DC6CON_SIZE                   equ 0001h
PSTR3CON_P3DC6CON_LENGTH                 equ 0001h
PSTR3CON_P3DC6CON_MASK                   equ 0040h

