GopalSaraf/Practicals/PSDL/include/proc/pic18f96j94.inc
// Register: SPBRG2
#define SPBRG2 SPBRG2
SPBRG2                                   equ 0F1Fh
// bitfield definitions
SPBRG2_SPBRG2_POSN                       equ 0000h
SPBRG2_SPBRG2_POSITION                   equ 0000h
SPBRG2_SPBRG2_SIZE                       equ 0008h
SPBRG2_SPBRG2_LENGTH                     equ 0008h
SPBRG2_SPBRG2_MASK                       equ 00FFh
SPBRG2_BRG0_POSN                         equ 0000h
SPBRG2_BRG0_POSITION                     equ 0000h
SPBRG2_BRG0_SIZE                         equ 0001h
SPBRG2_BRG0_LENGTH                       equ 0001h
SPBRG2_BRG0_MASK                         equ 0001h
SPBRG2_BRG1_POSN                         equ 0001h
SPBRG2_BRG1_POSITION                     equ 0001h
SPBRG2_BRG1_SIZE                         equ 0001h
SPBRG2_BRG1_LENGTH                       equ 0001h
SPBRG2_BRG1_MASK                         equ 0002h
SPBRG2_BRG2_POSN                         equ 0002h
SPBRG2_BRG2_POSITION                     equ 0002h
SPBRG2_BRG2_SIZE                         equ 0001h
SPBRG2_BRG2_LENGTH                       equ 0001h
SPBRG2_BRG2_MASK                         equ 0004h
SPBRG2_BRG3_POSN                         equ 0003h
SPBRG2_BRG3_POSITION                     equ 0003h
SPBRG2_BRG3_SIZE                         equ 0001h
SPBRG2_BRG3_LENGTH                       equ 0001h
SPBRG2_BRG3_MASK                         equ 0008h
SPBRG2_BRG4_POSN                         equ 0004h
SPBRG2_BRG4_POSITION                     equ 0004h
SPBRG2_BRG4_SIZE                         equ 0001h
SPBRG2_BRG4_LENGTH                       equ 0001h
SPBRG2_BRG4_MASK                         equ 0010h
SPBRG2_BRG5_POSN                         equ 0005h
SPBRG2_BRG5_POSITION                     equ 0005h
SPBRG2_BRG5_SIZE                         equ 0001h
SPBRG2_BRG5_LENGTH                       equ 0001h
SPBRG2_BRG5_MASK                         equ 0020h
SPBRG2_BRG6_POSN                         equ 0006h
SPBRG2_BRG6_POSITION                     equ 0006h
SPBRG2_BRG6_SIZE                         equ 0001h
SPBRG2_BRG6_LENGTH                       equ 0001h
SPBRG2_BRG6_MASK                         equ 0040h
SPBRG2_BRG7_POSN                         equ 0007h
SPBRG2_BRG7_POSITION                     equ 0007h
SPBRG2_BRG7_SIZE                         equ 0001h
SPBRG2_BRG7_LENGTH                       equ 0001h
SPBRG2_BRG7_MASK                         equ 0080h

// Register: SPBRGH2
#define SPBRGH2 SPBRGH2
SPBRGH2                                  equ 0F20h
// bitfield definitions
SPBRGH2_SPBRGH2_POSN                     equ 0000h
SPBRGH2_SPBRGH2_POSITION                 equ 0000h
SPBRGH2_SPBRGH2_SIZE                     equ 0008h
SPBRGH2_SPBRGH2_LENGTH                   equ 0008h
SPBRGH2_SPBRGH2_MASK                     equ 00FFh
SPBRGH2_BRG8_POSN                        equ 0000h
SPBRGH2_BRG8_POSITION                    equ 0000h
SPBRGH2_BRG8_SIZE                        equ 0001h
SPBRGH2_BRG8_LENGTH                      equ 0001h
SPBRGH2_BRG8_MASK                        equ 0001h
SPBRGH2_BRG9_POSN                        equ 0001h
SPBRGH2_BRG9_POSITION                    equ 0001h
SPBRGH2_BRG9_SIZE                        equ 0001h
SPBRGH2_BRG9_LENGTH                      equ 0001h
SPBRGH2_BRG9_MASK                        equ 0002h
SPBRGH2_BRG10_POSN                       equ 0002h
SPBRGH2_BRG10_POSITION                   equ 0002h
SPBRGH2_BRG10_SIZE                       equ 0001h
SPBRGH2_BRG10_LENGTH                     equ 0001h
SPBRGH2_BRG10_MASK                       equ 0004h
SPBRGH2_BRG11_POSN                       equ 0003h
SPBRGH2_BRG11_POSITION                   equ 0003h
SPBRGH2_BRG11_SIZE                       equ 0001h
SPBRGH2_BRG11_LENGTH                     equ 0001h
SPBRGH2_BRG11_MASK                       equ 0008h
SPBRGH2_BRG12_POSN                       equ 0004h
SPBRGH2_BRG12_POSITION                   equ 0004h
SPBRGH2_BRG12_SIZE                       equ 0001h
SPBRGH2_BRG12_LENGTH                     equ 0001h
SPBRGH2_BRG12_MASK                       equ 0010h
SPBRGH2_BRG13_POSN                       equ 0005h
SPBRGH2_BRG13_POSITION                   equ 0005h
SPBRGH2_BRG13_SIZE                       equ 0001h
SPBRGH2_BRG13_LENGTH                     equ 0001h
SPBRGH2_BRG13_MASK                       equ 0020h
SPBRGH2_BRG14_POSN                       equ 0006h
SPBRGH2_BRG14_POSITION                   equ 0006h
SPBRGH2_BRG14_SIZE                       equ 0001h
SPBRGH2_BRG14_LENGTH                     equ 0001h
SPBRGH2_BRG14_MASK                       equ 0040h
SPBRGH2_BRG15_POSN                       equ 0007h
SPBRGH2_BRG15_POSITION                   equ 0007h
SPBRGH2_BRG15_SIZE                       equ 0001h
SPBRGH2_BRG15_LENGTH                     equ 0001h
SPBRGH2_BRG15_MASK                       equ 0080h

// Register: DSGPR3
#define DSGPR3 DSGPR3
DSGPR3                                   equ 0F21h
// bitfield definitions
DSGPR3_DSGPR3_POSN                       equ 0000h
DSGPR3_DSGPR3_POSITION                   equ 0000h
DSGPR3_DSGPR3_SIZE                       equ 0008h
DSGPR3_DSGPR3_LENGTH                     equ 0008h
DSGPR3_DSGPR3_MASK                       equ 00FFh

// Register: DSGPR2
#define DSGPR2 DSGPR2
DSGPR2                                   equ 0F22h
// bitfield definitions
DSGPR2_DSGPR2_POSN                       equ 0000h
DSGPR2_DSGPR2_POSITION                   equ 0000h
DSGPR2_DSGPR2_SIZE                       equ 0008h
DSGPR2_DSGPR2_LENGTH                     equ 0008h
DSGPR2_DSGPR2_MASK                       equ 00FFh

// Register: DSGPR1
#define DSGPR1 DSGPR1
DSGPR1                                   equ 0F23h
// bitfield definitions
DSGPR1_DSGPR1_POSN                       equ 0000h
DSGPR1_DSGPR1_POSITION                   equ 0000h
DSGPR1_DSGPR1_SIZE                       equ 0008h
DSGPR1_DSGPR1_LENGTH                     equ 0008h
DSGPR1_DSGPR1_MASK                       equ 00FFh

// Register: DSGPR0
#define DSGPR0 DSGPR0
DSGPR0                                   equ 0F24h
// bitfield definitions
DSGPR0_DSGPR0_POSN                       equ 0000h
DSGPR0_DSGPR0_POSITION                   equ 0000h
DSGPR0_DSGPR0_SIZE                       equ 0008h
DSGPR0_DSGPR0_LENGTH                     equ 0008h
DSGPR0_DSGPR0_MASK                       equ 00FFh

// Register: DSWAKEH
#define DSWAKEH DSWAKEH
DSWAKEH                                  equ 0F25h
// bitfield definitions
DSWAKEH_DSINT0_POSN                      equ 0000h
DSWAKEH_DSINT0_POSITION                  equ 0000h
DSWAKEH_DSINT0_SIZE                      equ 0001h
DSWAKEH_DSINT0_LENGTH                    equ 0001h
DSWAKEH_DSINT0_MASK                      equ 0001h

